"""
公司需要一套员工绩效系统，请结合“用户登录验证”与“成绩评级”的逻辑编写程序：
1. 系统预设正确的员工工号为 `admin`，密码为 `888888`。
2. 使用 `for` 循环限制用户**最多只有 3 次登录机会**。
3. 登录判断逻辑：
   - 如果工号和密码都正确，提示“登录成功”，并进入**绩效评级环节**，随后使用 `break` 退出登录循环。
   - 如果工号错误，提示“工号错误”。
   - 如果工号正确但密码错误，提示“密码错误”。
   - 每次失败后，提示剩余机会次数。
4. 绩效评级环节
   ：登录成功后，要求输入员工本月销售额（需转换为浮点数），并按以下标准评级：
   - `>= 100000`：评级为 `S (业绩卓越)`
   - `>= 50000 且 < 100000`：评级为 `A (表现优秀)`
   - `>= 20000 且 < 50000`：评级为 `B (达标合格)`
   - `< 20000`：评级为 `C (仍需努力)`
5. **安全锁定机制**：如果 3 次登录全部失败，利用 `for...else` 结构，提示“错误次数过多，账号已锁定！”。
"""
for i in range(0,3):
    gonghao=input("请输入你的工号")
    mima=input(("请输入你的密码"))
    if gonghao=="admin":
        if mima=="888":
            print("登录成功进入绩效界面")
            jixiao=float(input("请输入你的绩效"))

            if jixiao>= 100000:
                print("评级为 `S (业绩卓越)`")
            elif jixiao>= 50000:
                print("评级为 `A (表现优秀)")
            elif jixiao>=20000:
                print("评级为 `B (达标合格)")
            else:
                print("评级为 `C (仍需努力)`")
            break
        else:
            print(f"你的密码输入错误，还剩下{3-i}次机会")
    else:
        print(f"你的工号错误，还剩下{3-i}次机会")
else:
    print("错误次数过多，账号已锁定！")