# 演示变量
"""
    定义变量的格式:
        变量的名称 = 值

        指的: 将等号右侧的值 赋值给 左侧的变量

    变量的名称定义规范:
        强制规范:
            1- 变量必须是以 数字 字母 或 下划线 组成
            2- 变量不能以数字开头
            3- 变量严格区分大小写
            4- 不能使用python中关键词作为变量名称

        推荐规范:
            1- 变量命名必须是见名知意
            2- 当变量名称涉及到多个单词的时候:
                方式一: 大驼峰命名    例如: MyName
                方式二: 小驼峰命名    例如: myName
                方式三:  下划线连接   例如:  my_name


"""

# 1- 定义一个年龄的变量 值为 18
age = 18

# 2- 定义一个名字的变量  值为 张三
userName = '张三'

# 如何使用变量呢?
# 如何调用: 通过变量名称
print(age)
print(userName)





