# 演示输出：
# 1- 百分号格式的输出
'''
    语法结构:
        print( '字符串信息.... %格式  %格式  %格式 ' % (变量1,变量2,变量3....) )

        说明: 在字符串中 引用变量 可以直接和字符串拼接在一起输出打印

        %格式:
            %s  字符串
            %d  有符号的整数
            %f  小数类型
'''

# 案例：定义两个变量name='itheima', age=18，按照如下格式进行输出：我的名字是itheima，今年18岁了。
# 定义变量
name = 'itheima'
age = 18

# 输出操作
print('我的名字是%s，今年%d岁了。' % (name, age))
# 基于format的简写方式:
print(f'我的名字是{name}，今年{age}岁了。')

# 案例：定义两个变量title='大白菜'，price=3.5，按照如下格式进行输出：今天蔬菜特价了，大白菜只要3.5元/斤。
# 定义变量:
title = '大白菜'
price = 3.5

# 输出变量: 百分号方式输出
print('今天蔬菜特价了，%s只要%.1f元/斤。' % (title, price))
# 基于format的简写方式:
print(f'今天蔬菜降价了,{title}只要{price}元/斤.')

# 使用 format格式输出
'''
    语法结构: 
        print('{}字符串信息{}'.format(变量1,变量2...))
'''
# 案例：定义两个变量，name='孙悟空'，mobile='18878569090'，按照以下格式进行输出"姓名：孙悟空，联系方式：18878569090"
# 定义变量
name = '孙悟空'
mobile = '18878569090'

# 输出操作
print('姓名：{}，联系方式：{}'.format(name,mobile))

# 针对format 提供更为精简的简化方案
print(f'姓名：{name}，联系方式：{mobile}')

print("---------------------------")

# 换行符 \n 和  制表符 \t
# print操作, 默认的结束符号为 \n, 如何调整的默认结束符号呢? 在print 添加一个 end参数
print('学AI,就来黑马程序员~~~')
print('学AI,就来黑马程序员~~~',end='\t')
print('学AI,就来黑马程序员~~~',end='\n')

print('学AI,就来\n\n黑马\t\t程序员~~~')