# 输入操作：
"""
    语法结构:
        变量 = input('提示信息内容...')

        指的: 将用户输入的内容, 通过变量接收

        注意: 用户输入的内容, 都是字符串类型的数据

"""
# 案例：银行系统中的，输入密码的过程: 提示内容 请输入您的密码？  并且打印出用户输入的内容
password = input('请输入您的密码:')  # 程序执行到这一行代码的时候, 会阻塞住, 等待用户的输入, 用户输入完成后 才会执行下面的代码
# 打印用户输入的内容:
print(f"用户输入的内容为:{password}")

# 查看变量的数据类型
print(type(password))  # <class 'str'>

print("-" * 100)
# 需求: 请键盘录入二个分别为用户名 和 密码 , 在录入的时候, 给用户做出提示, 例如 请输入您的用户名  并且将结果使用一个print打印出
# 1- 使用 input 实现键盘录入二个内容
userName = input('请输入您的用户名:')
password = input('请输入您的密码:')

# 2- 打印输出: 使用一个print语句输出
print(f"输入的用户名为:{userName},输入的密码为:{password}")